/************************************************************************/
/*							[2014.7.26 ] 
							GameObject 클래스 
					게임내의 모든 오브젝트의 부모 클래스
*/
/************************************************************************/
#pragma  once

//////////////////////////////////////////////////////////////////////////
// 전방선언




/************************************************************************/
/*						[2014.7.26 ]
						class CGameObject
*/
/************************************************************************/
class CGameObject
{
	
protected:

	LPDIRECT3DDEVICE9		   m_pDevice; // Our rendering device

public:

	CGameObject();

	virtual ~CGameObject();


public: //가상함수

	virtual HRESULT						SetDevice(LPDIRECT3DDEVICE9 _pDevice = nullptr);

public:// get.. set
					 


};

//////////////////////////////////////////////////////////////////////////
// 외부변수 선언
extern D3DXVECTOR3 g_AXIS_X;
extern D3DXVECTOR3 g_AXIS_Y;
extern D3DXVECTOR3 g_AXIS_Z;


//////////////////////////////////////////////////////////////////////////
// 이 클래스를 상속받는 클래스들



/****************************************************** End *****************************************************/