
//*****************************************************************************
// 2014. 06. 20
//
// 
//
// log파일 남기기위한 함수
//
//*****************************************************************************


#pragma once
#include <iostream>
#include <atlstr.h>

//로그파일에 문자열을 쓰는 함수
int write_log_file(CHAR *wstring);

//현재작업 디렉토리에 로그 텍스트 파일 만들어주는 함수
int create_log_file();

//////////////////////////////////////////////////////////////////////////
// 현재작업 디렉토리에 로그 텍스트 파일 만들어주는 함수
// 가변인자 적용
int LOG_WRITE_A(char* fmt, ...);


//-----------------------------------------------------------------------------
// Desc   : 가변인자 적용   유니코드용  char*  [2014.10.30 ]
//-----------------------------------------------------------------------------
int LOG_WRITE_W(WCHAR* fmt, ...);


CString PrintErrorMessage(DWORD err);

//************************************ 끝 ***************************************